koshkin-sergey/mbOS/Device/ADI/ADuC7023/SVD/ADUC7023.svd
      </registers>  
    </peripheral>

    <!-- DAC -->
    <peripheral>
      <name>DAC</name>
      <description>Digital-to-Analog Converter</description>
      <groupName>DAC</groupName>
      <baseAddress>0xFFFF0600</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6C</size>
        <usage>registers</usage>
      </addressBlock>      
      <registers>
        <register>
          <name>DAC0CON</name>
          <description>DAC0 control register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DACRN</name>
              <description>DAC range bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>

            <field>
              <name>DACCLR</name>
              <description>DAC clear bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>

            <field>
              <name>DACCLK</name>
              <description>DAC update rate</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>

            <field>
              <name>DACBY</name>
              <description>DAC bypass the output buffer bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>DAC0DAT</name>
          <description>DAC0 data register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACDAT</name>
              <description>12-bit data for DAC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>DAC1CON</name>
          <description>DAC1 control register</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DACRN</name>
              <description>DAC range bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>

            <field>
              <name>DACCLR</name>
              <description>DAC clear bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>

            <field>
              <name>DACCLK</name>
              <description>DAC update rate</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>

            <field>
              <name>DACBY</name>
              <description>DAC bypass the output buffer bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>DAC1DAT</name>
          <description>DAC1 data register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACDAT</name>
              <description>12-bit data for DAC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>DAC2CON</name>
          <description>DAC2 control register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DACRN</name>
              <description>DAC range bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>

            <field>
              <name>DACCLR</name>
              <description>DAC clear bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>

            <field>
              <name>DACCLK</name>
              <description>DAC update rate</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>

            <field>
              <name>DACBY</name>
              <description>DAC bypass the output buffer bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>DAC2DAT</name>
          <description>DAC2 data register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACDAT</name>
              <description>12-bit data for DAC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>DAC3CON</name>
          <description>DAC3 control register</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DACRN</name>
              <description>DAC range bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>

            <field>
              <name>DACCLR</name>
              <description>DAC clear bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>

            <field>
              <name>DACCLK</name>
              <description>DAC update rate</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>

            <field>
              <name>DACBY</name>
              <description>DAC bypass the output buffer bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>DAC3DAT</name>
          <description>DAC3 data register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACDAT</name>
              <description>12-bit data for DAC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>DACBKEY0</name>
          <description>DAC Key0 register</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
        </register>

        <register>
          <name>DACBCFG</name>
          <description>DAC Configuration register</description>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DAC0BUF</name>
              <description>DAC0 output buffer in op amp mode bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>

            <field>
              <name>DAC1BUF</name>
              <description>DAC1 output buffer in op amp mode bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>

            <field>
              <name>DAC2BUF</name>
              <description>DAC2 output buffer in op amp mode bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>

            <field>
              <name>DAC3BUF</name>
              <description>DAC3 output buffer in op amp mode bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>DACBKEY1</name>
          <description>DAC Key1 register</description>
          <addressOffset>0x58</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
        </register>
